[
    {
        "title": "BURNR — Tech lead, Social fitness platform",
        "link": "https://www.joshuadematas.me/?project=BURNR",
        "description": "A social fitness platform built primarily in Go and React Native.",
        "bullets": [
            "Led backend design, service boundaries, and tech stack decisions.",
            "Designed hybrid storage using PostgreSQL, Firestore, and Cloud Storage.",
            "Integrated Apple Health syncing and leaderboard ranking based on user goals.",
            "Upgraded caching and pub/sub with Dragonfly and Redpanda.",
            "Deployed backend on self-hosted VPS using Docker Stack/Swarm."
        ],
        "isHobby": false
    },
    {
        "title": "Garden Observer — Real-time 3D Robot Visualization",
        "description": "A full-stack web app to monitor live and simulated robot lawnmowers in 3D.",
        "link": "https://www.joshuadematas.me/?project=Garden%20Observer",
        "bullets": [
            "Combined Unity Wasm for 3D rendering with Blazor for UI and control layer.",
            "Parsed SVG layouts to generate meshes for 3D environments.",
            "Used an internal event hub for real-time robot telemetry, updating position in 3D space.",
            "Created a Blazor-to-Unity component bridge (akin to custom React renderer)."
        ],
        "isHobby": false
    },
    {
        "title": "Coconut — SSH-Based HTTP Tunnel",
        "description": "An HTTP tunnel over SSH in Go (similar to Ngrok), using only standard libraries.",
        "link": "https://www.joshuadematas.me/?project=Coconut",
        "bullets": [
            "Designed reverse proxy routing based on subdomains and SSH channels.",
            "Added multiplexed and dedicated tunnels to handle websockets and long-lived connections.",
            "Currently building a production-ready version with full monitoring and tests."
        ],
        "isHobby": true
    },
    {
        "title": "Stolen Mower Management — Product tracking tool",
        "description": "Internal tool at Husqvarna Group to assist in tracking down stolen Automowers.",
        "link": "https://www.joshuadematas.me/?project=Stolen%20Mower%20Management",
        "bullets": [
            "Built with C# and Blazor.",
            "Built on Azure using Azure Service Bus, Azure Functions, CosmosDB, etc.",
            "Integrates external APIs like Google Maps for better location context."
        ],
        "isHobby": false
    }
]